Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/runsc/tomcat/target_count_5/repeat_16/4.txt
2020/02/07 23:18:40 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8004/
2020/02/07 23:19:10 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 43067 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8004
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.001 seconds
Complete requests:      43067
Failed requests:        0
Non-2xx responses:      43067
Total transferred:      37382156 bytes
HTML transferred:       30706771 bytes
Requests per second:    1435.52 [#/sec] (mean)
Time per request:       69.661 [ms] (mean)
Time per request:       0.697 [ms] (mean, across all concurrent requests)
Transfer rate:          1216.83 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   4.5      2      49
Processing:     1   65  73.2     37    1068
Waiting:        1   64  70.2     37    1056
Total:          1   69  73.3     41    1069
Percentage of the requests served within a certain time (ms)
  50%     41
  66%     73
  75%     90
  80%    106
  90%    204
  95%    216
  98%    228
  99%    245
 100%   1069 (longest request)
2020/02/07 23:19:10 Matched stat line [Connect:        0    3   4.5      2      49 Connect 0 3 4.5 2 49]
2020/02/07 23:19:10 Matched stat line [Processing:     1   65  73.2     37    1068 Processing 1 65 73.2 37 1068]
2020/02/07 23:19:10 Matched stat line [Waiting:        1   64  70.2     37    1056 Waiting 1 64 70.2 37 1056]
2020/02/07 23:19:10 Matched stat line [Total:          1   69  73.3     41    1069 Total 1 69 73.3 41 1069]
2020/02/07 23:19:10 Matched percentline [  50%     41 50 41]
2020/02/07 23:19:10 Matched percentline [  66%     73 66 73]
2020/02/07 23:19:10 Matched percentline [  75%     90 75 90]
2020/02/07 23:19:10 Matched percentline [  80%    106 80 106]
2020/02/07 23:19:10 Matched percentline [  90%    204 90 204]
2020/02/07 23:19:10 Matched percentline [  95%    216 95 216]
2020/02/07 23:19:10 Matched percentline [  98%    228 98 228]
2020/02/07 23:19:10 Matched percentline [  99%    245 99 245]
{"connect":{"max":49,"mean":3,"median":2,"min":0,"stdDev":4.5},"percentiles":{"100":1069,"50":41,"66":73,"75":90,"80":106,"90":204,"95":216,"98":228,"99":245},"processing":{"max":1068,"mean":65,"median":37,"min":1,"stdDev":73.19999694824219},"total":{"max":1069,"mean":69,"median":41,"min":1,"stdDev":73.30000305175781},"waiting":{"max":1056,"mean":64,"median":37,"min":1,"stdDev":70.19999694824219}}
2020/02/07 23:19:10 Matched percentline [ 100%   1069 100 1069]